tutorials/cfdemSolverVoF/bubbleRisingAgainstParticles/CFD/constant/liggghtsCommands
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          liggghtsCommands;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

liggghtsCommandModels
(
    runLiggghts
    writeLiggghts
);

// ************************************************************************* //

writeLiggghtsProps
{
    writeLast on;
    // path "../DEM/post/restart";
    writeName "post/restart/liggghts.restartCFDEM";
    overwrite on;
    // verbose;
}
